OpenFOAM/benchmark_cases_FLiBe/laminar/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | https://openfoam.org
    \\  /    A nd           | Version: 13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        tolerance        1e-6;
        relTol           0.01;

        smoother         DICGaussSeidel;

    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "(U|k|epsilon)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-5;
        relTol          0.01;
    }

    "(U|k|epsilon)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    nNonOrthogonalCorrectors 0;
    nCorrectors         2;
} 

// SIMPLE
// {
//     nNonOrthogonalCorrectors 0;
//     consistent yes;

//     residualControl
//     {
//         p               1e-2;
//         U               1e-3;
//     }
// }

// potentialFlow
// {
//     nNonOrthogonalCorrectors 10;
// }

// relaxationFactors
// {
//     equations
//     {
//         U               0.7; 
//         p               0.3;
//     }
// }

// cache
// {
//     grad(U);
// }



// ************************************************************************* //
